#include "middle_list.h"

void itc_pos_neg_analysis_lst(const vector <int> &lst)
{
    cout << "Положительные:            Отрицательные:\n";
    cout << "Количество чисел: "  << "            Количество чисел: "  << "\n";
    cout << "Максимальная цифра: "  << "            Максимальная цифра: "  << "\n";
    cout << "Минимальная цифра: "  << "            Минимальная цифра: "  << "\n";
    cout << "Сумма цисел: "  << "            Сумма чисел: "  << "\n";
    cout << "Среднее значение: "  << "            Среднее значение: "  << "\n\n";
    cout << "Количество нулей: "  << "\n";
}
